// Семинар № 1

// Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

/*
Console.WriteLine("Введите число a: ");
int num_A = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите число b: ");
int num_B = Convert.ToInt32(Console.ReadLine());

if (num_A > num_B)
{
    Console.WriteLine("a " + num_A + " > b "  + num_B);
}
else
{
    Console.WriteLine("b " + num_B + " > a " + num_A);
}
*/
// Задача 2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

/*
Console.WriteLine("Введите три числа: ");
int num_1 = Convert.ToInt32(Console.ReadLine());
int num_2 = Convert.ToInt32(Console.ReadLine());
int num_3 = Convert.ToInt32(Console.ReadLine());

int max = num_1;

if (num_2 > max) ;
{ 
Console.WriteLine(max = num_2) ;
}


if (num_3 > max) ;
{
    Console.WriteLine(max = num_3);
}
Console.WriteLine("Максимальное из этих чисел " + max);
*/

// Задача 3:  Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

/*
Console.WriteLine("Введите число:");
 int num = Convert.ToInt32(Console.ReadLine());

if (num % 2 == 1)
{
    Console.WriteLine(num +   " нечетное");
}
else
{
    Console.WriteLine( num + " четное" );
}

*/


// Задача 4: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.


