// Семинар № 3.


//Задача 1 Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

/*
Console.Write("Введите пятизначное число, ");
int n = Convert.ToInt32(Console.ReadLine());
int n1 = (n / 10000);
int n5 = (n % 10);
int n2 = (n / 1000 % 10);
int n4 = (n / 10 % 10);

if (n1 == n5 && n2 == n4)
{
  Console.Write($"{n} является палиндромом");  
}
else
{
    Console.Write($"{n} не является палиндромом");    
}
*/

//Задача 2 Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.


